Tekla Open API Reference for Tekla Structures 2025
View Methods
The View type exposes the following members.
Methods
Name | Description
Create3dView(Drawing, Point, View.ViewAttributes, View)
 Generates a new 3d view on the sheet of the given active drawing.
Create3dView(Drawing, CoordinateSystem, CoordinateSystem, AABB, Point, View.ViewAttributes, View)
 Generates a new 3d view on the sheet of the given active drawing using given view plane and display plane.
CreateBackView
 Generates a new back view on the sheet of the given active drawing.
CreateBottomView
 Generates a new bottom view on the sheet of the given active drawing.
CreateCurvedSectionView
 Generates a new curved section view on the sheet of the active drawing and the associated section mark for the specified view.
CreateDetailView
 Generates a new detail view on the sheet of the active drawing and the associated detail mark for the specified view.
CreateFrontView
 Generates a new front view on the sheet of the given active drawing.
CreateSectionView
 Generates a new section view on the sheet of the active drawing and the associated section mark for the specified view.
CreateTopView
 Generates a new top view on the sheet of the given active drawing.
Delete
 Deletes the view and its children objects from the database.
 (Inherited from ViewBase.)
GetAllObjects()
 Gets all the objects and their children objects in the view.
 (Inherited from ViewBase.)
GetAllObjects(Type)
 Gets all the objects and their children objects in the view that are of a certain type.
 (Inherited from ViewBase.)
GetAllObjects(Type[])
 Gets all the objects and their children objects in the view that are of certain types.
 (Inherited from ViewBase.)
GetAxisAlignedBoundingBox
 The view size in paper coordinates.
 (Inherited from ViewBase.)
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDrawing
 Gets the drawing where the drawing object is.
 (Inherited from DrawingObject.)
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetModelObjects()
 Gets the model objects that are in the view.
GetModelObjects(Identifier)
 Gets the drawing model objects based on given model object identifier. If used from sheet model objects from all views are returned.
 (Inherited from ViewBase.)
GetObjects()
 Gets the objects in the view. Does not return child objects (single dimensions, grid lines, views).
 (Inherited from ViewBase.)
GetObjects(Type[])
 Gets the objects in the view that are of certain types. Does not return child objects (single dimensions, grid lines, views).
 (Inherited from ViewBase.)
GetOriginalDrawing
 Gets the drawing on which the view was originally created. @see DrawingObject.GetDrawing() for retrieving the current drawing the object resides on.
 (Inherited from ViewBase.)
GetRelatedObjects()
 Gets the related objects of the current object.
 (Inherited from DrawingObject.)
GetRelatedObjects(Type[])
 Gets the related objects of the current object that are of certain types.
 (Inherited from DrawingObject.)
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetView
 Gets the view where the drawing object is.
 (Inherited from DrawingObject.)
GetVisibleAreaRestrictionBoxes
 Gets the restriction boxes that represent the visible areas of the view.
Insert
 Inserts the view to the database.
 (Inherited from ViewBase.)
IsEqual
 Compares the current object with an object of the same type.
 (Overrides ViewBase.IsEqual(Object).)
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Inherited from DatabaseObject.)
Modify
 Modifies the view in the database.
 (Inherited from ViewBase.)
RotateViewOnAxisX
 Rotate the view on the X axis.
RotateViewOnAxisY
 Rotate the view on the Y axis.
RotateViewOnAxisZ
 Rotate the view on the Z axis.
RotateViewOnDrawingPlane
 Rotate the view on the drawings plane. This works just like the user interface command "Rotate view".
Select
 Selects the view from the database.
 (Inherited from ViewBase.)
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
ToString
 Changes the string presentation of the drawing object.
 (Inherited from DrawingObject.)
Top
See Also
Reference
View Class
Tekla.Structures.Drawing Namespace